<?php
	header('Content-Type:text/html;charset=UTF-8');
	$search=$_REQUEST['search'];
	$list=[
	 "耐克" , "KAPPA" , "李宁" , "ADIDAS" , "宝元" , "彪马" , "乔丹" , "CONVERSE" , "乐飞叶" , "REEBOK" , "美津浓" , "UMBRO" , "MIZUNO" , "361度", "茵宝" , "锐步" , "PROTONIC" , "匡威" , "安踏" , "花花公子" , "波特" , "新百伦" , "AVIA" , "特步" , "康威" , "ASICS" , "莱氏" , "乐图" , "哥伦布", "迪亚多纳" , "霹雳道" , "别克" , "三叶草" , "红迪丝" , "双星" , "百事" , "日高" , "金莱克" , "EXR" , "KSWISS" , "亚礼得" , "哥伦比亚" , "爱威亚", "浩沙" , "rapido" , "卡帝乐鳄鱼" , "纽巴伦" , "N-SHOP" , "匹克", "G2000" , "雅戈尔" , "法利鳄鱼" , "皮特丹顿" , "蓝豹" , "九牧王" , "路易诗兰" ,"马克华菲" , "法国鳄鱼" , "蔓哈顿", "汤尼威尔" , "雷迪波尔" , "柏郎亚高" , "杰凡尼" , "皮尔卡丹" , "堡尼" , "杉杉" , "罗蒙" , "金利来" , "迪迪公子", "报喜鸟" , "法派" , "TONY" , "汤尼俊仕" , "花雨伞" , "花花公子" , "U2" , "卡努迪路", "BOSS" , "迪莱" , "梦特娇" , "宝姿" , "海澜之家" ,"ESPRIT" , "保罗世家" , "NAUTICA" , "巴贝" , "鳄鱼恤" , "比华利保罗" , "波司登" , "七匹狼" , "USPOLO" , "塔吉" , "奥德臣" , "斯诺沙克" , "卡利斯特" , "威可多" , "JOEONE" , "马思图" , "巴利" , "尼诺卡丹" , "雷诺天蒙" , "虎都", "圣大保罗" , "卡迪尔" , "浙江鳄鱼" , "法国圣龙" , "沙弛" , "GORNIA" , "卡斯德利" , "杰克琼斯" , "巴宝利" , "迪赛" , "汤米" , "路易世尊" , "鄂尔多斯" , "路易德士" , "与狼共舞" , "老爷车" , "轩帝尼" , "凯撒" , "V-ONE" , "富铤" , "旗牌王" , "娃娃鱼" , "胜龙" , "昂斯" , "布莱.希尔顿" , "马基堡" , "北京威可多" , "日弛尼" , "波顿" , "克美.米罗" , "卓凡里诺" , "歌德克依" , "萨巴帝尼" , "登喜路" , "吉普" , "洛滋" , "PIEE DENTON" , "铁狮丹顿" , "萨托尼" , "西海岸" , "培罗城" , "帕给维龙" , "法函诗" , "意劳迪斯" , "应大" , "依文" , "NOVELI" 
	];
	foreach($list as $v){
		if(stripos($v,$search)!==FALSE){
			echo "<li>$v</li>";
		}
	}
?>